from pyecharts import options as opts
from pyecharts.charts import WordCloud

words = [
('中国', 12), ('生活', 12), ('历史', 5), ('人生', 5), ('社会', 5),
    ('故事', 5), ('孩子', 4), ('代表作', 4), ('时代', 4), ('生命', 4),
    ('人类', 3), ('教育', 3), ('入门', 3), ('探索', 3), ('时间', 3), ('写给', 3),
    ('北京', 3), ('命运', 3), ('完整', 3), ('爱情', 3), ('电影', 3), ('文学', 3), ('东西', 3),
    ('不能', 3), ('政治', 2), ('制度', 2), ('生存', 2), ('问题', 2), ('自由', 2), ('悲剧', 2), ('法律', 2),
    ('哲学', 2), ('家庭', 2), ('美国', 2), ('核心', 2), ('大人', 2), ('时期', 2), ('意义', 2), ('灵魂', 2), ('现实主义', 2),
    ('世界', 2), ('往事', 2), ('张郎', 2), ('人性', 2), ('绝唱', 2), ('乱世', 2), ('原著', 2), ('量子', 2), ('史诗', 2), ('纷扰', 2),
    ('研究', 2), ('文化', 2), ('结构', 2), ('经历', 2), ('内心', 2), ('灾难', 2), ('三毛', 2), ('心灵', 2), ('经典之作', 2), ('监禁', 2),
    ('风格', 2), ('完美', 2), ('死亡', 2), ('战争', 2), ('困惑', 2), ('历程', 2), ('地狱', 2), ('月亮', 2), ('出卖', 2), ('简明', 1), ('乌托邦', 1),
    ('毁灭', 1), ('值得', 1), ('思考', 1), ('作者', 1), ('幽默', 1), ('语言', 1), ('观察', 1), ('替天行道', 1), ('伴随', 1), ('惩罚', 1), ('人性化', 1),
    ('日益', 1), ('丧失', 1), ('熟读', 1), ('唐诗三百', 1), ('不会', 1), ('吟诗', 1), ('雷雨', 1), ('爆发', 1), ('收录', 1), ('散文', 1), ('法治', 1),
    ('国家', 1), ('民众', 1), ('运用', 1), ('转头', 1), ('回忆录', 1), ('窥见', 1), ('经济学家', 1), ('世界观', 1), ('沙漠', 1), ('寻常', 1), ('神魔', 1),
    ('人情', 1), ('精魅', 1), ('世故', 1), ('火焰', 1), ('诗歌', 1), ('读者', 1), ('空间', 1), ('秘密', 1), ('阿拉伯地区', 1), ('蜘蛛', 1), ('小猪', 1),
    ('遥远', 1), ('敦煌', 1), ('戈壁', 1), ('抗战', 1), ('胜利', 1), ('风貌', 1), ('侦探', 1), ('代名词', 1), ('见微知著', 1), ('历史观', 1), ('颠覆', 1),
    ('贫苦', 1), ('市民', 1), ('典型', 1), ('侠之大者', 1), ('争取', 1), ('钱穆', 1), ('中国通史', 1), ('妖术', 1), ('恐慌', 1), ('奇迹', 1), ('阿勒泰', 1),
    ('精灵', 1), ('男孩', 1), ('桑桑', 1), ('刻骨铭心', 1), ('终身难忘', 1), ('小学', 1), ('沉默', 1), ('沉默者', 1), ('通行证', 1), ('离奇命案', 1),
    ('牵出', 1), ('跨度', 1), ('步步', 1), ('惊心', 1), ('基本原理', 1), ('操作', 1), ('细节', 1), ('民族', 1), ('画卷', 1), ('充满', 1), ('凑巧', 1),
    ('淡泊', 1), ('清透', 1), ('哲学著作', 1), ('义无反顾', 1), ('直达', 1), ('游荡', 1), ('萧红', 1), ('高贵', 1), ('残破', 1), ('镜像', 1), ('革命', 1),
    ('随风而逝', 1), ('光怪陆离', 1), ('场景', 1), ('迷失', 1), ('引发', 1), ('一连串', 1), ('史家', 1), ('离骚', 1), ('同名同姓', 1), ('误会', 1),
    ('可贵', 1), ('母体', 1), ('献给', 1), ('长成', 1), ('报恩', 1), ('复仇', 1), ('法国', 1), ('王朝', 1), ('背景', 1), ('唐人', 1), ('传奇', 1),
    ('贯注', 1), ('情趣', 1), ('澳洲', 1), ('面对', 1), ('强大', 1), ('对手', 1), ('明知', 1), ('笔墨', 1), ('苍之厚', 1), ('人间', 1), ('脂粉', 1),
    ('变成', 1), ('半明半暗', 1), ('教父', 1), ('科学', 1), ('事实', 1), ('臆测', 1), ('纯美', 1), ('纯善', 1), ('泯灭', 1), ('童心', 1), ('没有', 1),
    ('城乡', 1), ('全景', 1), ('眼光', 1), ('评旧', 1), ('浪漫主义', 1), ('杰作', 1), ('罪孽', 1), ('福祉', 1), ('武侠', 1), ('解构', 1), ('流氓', 1),
    ('狂欢', 1), ('长亭', 1), ('古道', 1), ('芳草', 1), ('有情', 1), ('无人', 1), ('不冤', 1), ('英雄', 1), ('穿越', 1), ('银河', 1), ('冒险', 1),
    ('生气', 1), ('路漫漫其修远兮', 1), ('新文学', 1), ('呐喊', 1), ('闲静', 1), ('物理', 1), ('史话', 1), ('人们', 1), ('思索', 1),
    ('影响', 1), ('建立联系', 1), ('鸦片战争', 1), ('江南', 1), ('乡镇', 1), ('民间', 1), ('健康', 1), ('淳朴', 1), ('乡土', 1),
    ('传统', 1), ('理论', 1), ('阿加莎', 1), ('谋杀', 1), ('诡计', 1), ('惊人', 1), ('波洛', 1), ('抉择', 1), ('耐人寻味', 1),
    ('豆瓣', 1), ('人会', 1), ('顿悟', 1), ('甘愿', 1), ('放逐', 1), ('描绘', 1), ('全部', 1), ('深度', 1), ('世纪', 1), ('知识分子', 1),
    ('心灵史', 1), ('思无邪', 1), ('野草', 1)]




c = (
    WordCloud()
    .add("", words, word_size_range=[12, 30],        mask_image='static/assets/img/tiger(1).png',
         textstyle_opts=opts.TextStyleOpts(font_family="circle"))
    .set_global_opts(title_opts=opts.TitleOpts(title="词频统计"))
    .render("templates/wordcloud_custom_mask_image.html")
)
#
# c = (
#     WordCloud()
#     .add("", words, word_size_range=[6, 20], mask_image='C:\\Users\\cute yuan bao\\Desktop\\tiger(2).png', textstyle_opts=opts.TextStyleOpts(font_family="circle"))
#     .set_global_opts(title_opts=opts.TitleOpts(title="WordCloud-自定义图片"))
#     .render("wordcloud_custom_mask_image.html")
# )